In [1]:
# import necessary modules
import pandas as pd 
import numpy as np
import math 
from sklearn import linear_model

In [2]:
# visualize dataframe original
df = pd.read_csv('datasets/homeprices_mv.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [3]:
# Clean up data NaN. use median function to update or clean the value
median_bedrooms=math.floor(df.bedrooms.median())
print(median_bedrooms)
df.bedrooms=df.bedrooms.fillna(median_bedrooms)
df

4

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [4]:
# creating lin reg
reg = linear_model.LinearRegression() #object creation
reg.fit(df[['area','bedrooms','age']],df.price)

print('coeffs :'+str(reg.coef_))
print('intercept :'+str(reg.intercept_))

pred1 = reg.predict([[3000,3,40]]) #area,bedrooms,age
print(pred1)

pred2 = reg.predict([[2500,4,5]])
print(pred2)

df

coeffs :[  112.06244194 23388.88007794 -3231.71790863]
intercept :221323.00186540396
[498408.25158031]
[578876.03748933]

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [14]:
#exercise problem 
#find for:
#exp 2, test 9, int 6
#exp 12,test 10, int 10
df2= pd.read_csv('datasets/hiring.csv')

df2

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [15]:
#fill in the NaN test scores
median_test_score=math.floor(df2['test_score(out of 10)'].median())
df2['test_score(out of 10)']=df2['test_score(out of 10)'].fillna(median_test_score)

df2

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [16]:
from word2number import w2n

#fill NaN of experience with 0
df2.experience = df2.experience.fillna('0')
df2

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [17]:
df2.experience=df2.experience.apply(w2n.word_to_num) #apply method
df2

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [18]:
#create linear reg
reg2 = linear_model.LinearRegression()
reg2.fit(df2[['experience','test_score(out of 10)','interview_score(out of 10)']],df2['salary($)'])

print('coeffs :'+str(reg2.coef_))
print('intercept :'+str(reg2.intercept_))


pred3 = reg2.predict([[2,9,6]]) #exp,testscore,intscore
print(pred3)

pred4 = reg2.predict([[12,10,10]])
print(pred4)

df2

coeffs :[2812.95487627 1845.70596798 2205.24017467]
intercept :17737.263464337702
[53205.96797671]
[92002.18340611]

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000